{
  "shlokas": [
    {
      "sr#": "1-1",
      "chapter": 1,
      "shloka": "धृतराष्ट्र उवाच। धर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः। मामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय॥१-१॥",
      "summary": "Dhritarashtra asks Sanjaya about the gathering of his sons and the Pandavas at Kurukshetra.",
      "details": "This is the opening verse of the Bhagavad Gita. King Dhritarashtra, blind and anxious about the outcome of the war, asks his charioteer and advisor Sanjaya to describe what his sons and the Pandavas are doing on the holy battlefield of Kurukshetra. This verse sets the stage for the entire dialogue.",
      "tags": [
        "introduction",
        "Kurukshetra",
        "dharma",
        "war"
      ],
      "notes": "",
      "audio": ""
    },
    {
      "sr#": "1-28",
      "chapter": 1,
      "shloka": "अर्जुन उवाच। दृष्ट्वेमं स्वजनं कृष्ण युयुत्सुं समुपस्थितम्। सीदन्ति मम गात्राणि मुखं च परिशुष्यति॥१-२८॥",
      "summary": "Seeing his kinsmen arrayed for battle, Arjuna's limbs fail and his mouth dries up.",
      "details": "Arjuna expresses his physical and emotional distress upon seeing his relatives, teachers, and friends assembled on both sides of the battlefield ready to fight. His body trembles, his mouth becomes dry, and he experiences deep anguish. This marks the beginning of Arjuna's moral crisis.",
      "tags": [
        "Arjuna's dilemma",
        "compassion",
        "emotional crisis",
        "attachment"
      ],
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 1,
      "shloka": "कार्पण्यदोषोपहतस्वभावः पृच्छामि त्वां धर्मसम्मूढचेताः। यच्छ्रेयः स्यान्निश्चितं ब्रूहि तन्मे शिष्यस्तेऽहं शाधि मां त्वां प्रपन्नम्॥२-७॥",
      "summary": "Overcome by weakness, confused about duty, Arjuna surrenders to Krishna as a disciple seeking guidance.",
      "details": "Arjuna's confusion reaches its peak. His nature is overwhelmed by weakness and his mind is confused about dharma. He asks Krishna to guide him definitively about what is best. He formally accepts Krishna as his teacher and surrenders to Him for instruction. This moment marks the beginning of the Gita's teachings.",
      "tags": [
        "surrender",
        "guru-disciple",
        "confusion",
        "seeking guidance",
        "dharma"
      ],
      "sr#": "2-7",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 2,
      "shloka": "अशोच्यानन्वशोचस्त्वं प्रज्ञावादांश्च भाषसे। गतासूनगतासूंश्च नानुशोचन्ति पण्डिताः॥२-११॥",
      "summary": "You grieve for those who should not be grieved for, yet you speak words of wisdom. The wise grieve neither for the living nor the dead.",
      "details": "Krishna begins His teaching by pointing out the contradiction in Arjuna's behavior - he speaks like a wise person but grieves like an ignorant one. True wisdom lies in understanding the eternal nature of the soul, which transcends life and death. The wise do not lament for either the living or the dead because they understand the immortal nature of the Self.",
      "tags": [
        "wisdom",
        "grief",
        "soul",
        "immortality",
        "knowledge"
      ],
      "sr#": "2-11",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 2,
      "shloka": "नासतो विद्यते भावो नाभावो विद्यते सतः। उभयोरपि दृष्टोऽन्तस्त्वनयोस्तत्त्वदर्शिभिः॥२-१६॥",
      "summary": "The unreal has no existence; the real never ceases to be. Seers of truth know the nature of both.",
      "details": "Krishna establishes the fundamental metaphysical principle distinguishing the real (sat) from the unreal (asat). The body and material world are temporary and therefore unreal, while the soul (Atman) is eternal and therefore real. Those who see the truth understand this distinction clearly. This forms the basis for fearlessness in the face of death.",
      "tags": [
        "reality",
        "truth",
        "metaphysics",
        "eternal",
        "temporary"
      ],
      "sr#": "2-16",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 2,
      "shloka": "वासांसि जीर्णानि यथा विहाय नवानि गृह्णाति नरोऽपराणि। तथा शरीराणि विहाय जीर्णान्यन्यानि संयाति नवानि देही॥२-२२॥",
      "summary": "As a person sheds worn-out garments and wears new ones, the soul casts off worn-out bodies and enters new ones.",
      "details": "Krishna uses a beautiful analogy to explain reincarnation. Just as we discard old clothes and wear new ones, the eternal soul discards old, worn-out bodies and takes on new ones. This verse teaches that death is merely a change of the body, not the destruction of the soul. Understanding this removes the fear of death.",
      "tags": [
        "reincarnation",
        "soul",
        "body",
        "transmigration",
        "immortality"
      ],
      "sr#": "2-22",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 2,
      "shloka": "हतो वा प्राप्स्यसि स्वर्गं जित्वा वा भोक्ष्यसे महीम्। तस्मादुत्तिष्ठ कौन्तेय युद्धाय कृतनिश्चयः॥२-३७॥",
      "summary": "If killed, you will attain heaven; if victorious, you will enjoy the earth. Therefore arise and fight with determination.",
      "details": "Krishna presents the practical argument for a warrior. If Arjuna dies in battle fighting for dharma, he will attain heaven. If he wins, he will enjoy sovereignty on earth. Either way, fulfilling his duty as a warrior is beneficial. This verse appeals to both spiritual and worldly motivations.",
      "tags": [
        "duty",
        "warrior dharma",
        "heaven",
        "victory",
        "determination"
      ],
      "sr#": "2-37",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 2,
      "shloka": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन। मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥२-४७॥",
      "summary": "You have the right to perform your duty, but not to the fruits of your actions.",
      "details": "This is one of the most famous verses of the Gita. Krishna teaches Arjuna about Karma Yoga - the path of selfless action. One should focus on performing their duty without attachment to the results. Don't be motivated by the fruits of action, nor should you be attached to inaction. This principle helps in performing duties without anxiety about outcomes.",
      "tags": [
        "karma yoga",
        "detachment",
        "duty",
        "selfless action",
        "non-attachment"
      ],
      "sr#": "2-47",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 2,
      "shloka": "योगस्थः कुरु कर्माणि सङ्गं त्यक्त्वा धनञ्जय। सिद्ध्यसिद्ध्योः समो भूत्वा समत्वं योग उच्यते॥२-४८॥",
      "summary": "Perform your duty with equanimity, being balanced in success and failure - this is called Yoga.",
      "details": "Krishna explains that true Yoga is the state of equanimity. Perform your actions while abandoning attachment, remaining balanced in both success and failure. This mental equilibrium is the essence of Yoga. It frees one from the dualities of life and leads to inner peace.",
      "tags": [
        "equanimity",
        "yoga",
        "balance",
        "detachment",
        "inner peace"
      ],
      "sr#": "2-48",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 3,
      "shloka": "यज्ञार्थात्कर्मणोऽन्यत्र लोकोऽयं कर्मबन्धनः। तदर्थं कर्म कौन्तेय मुक्तसङ्गः समाचर॥३-९॥",
      "summary": "Work done as a sacrifice for the Divine frees one from bondage; all other work binds one to this world.",
      "details": "Krishna teaches that actions performed as an offering to the Divine (Yajna) liberate the soul, while actions done for personal gain bind one to the material world. When work is done with a spirit of dedication to the Supreme, it purifies the heart and leads to moksha (liberation). Therefore, perform your duties without attachment.",
      "tags": [
        "yajna",
        "sacrifice",
        "liberation",
        "bondage",
        "selfless service"
      ],
      "sr#": "3-9",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 4,
      "shloka": "यदा यदा हि धर्मस्य ग्लानिर्भवति भारत। अभ्युत्थानमधर्मस्य तदात्मानं सृजाम्यहम्॥४-७॥",
      "summary": "Whenever there is a decline of righteousness and rise of unrighteousness, I manifest Myself.",
      "details": "This famous verse explains the divine principle of Avatar - God's incarnation. Whenever dharma (righteousness) declines and adharma (unrighteousness) prevails, the Supreme Lord manifests in physical form. This divine intervention restores balance and protects the righteous while establishing the principles of dharma.",
      "tags": [
        "avatar",
        "dharma",
        "divine incarnation",
        "righteousness",
        "cosmic order"
      ],
      "sr#": "4-7",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 4,
      "shloka": "परित्राणाय साधूनां विनाशाय च दुष्कृताम्। धर्मसंस्थापनार्थाय सम्भवामि युगे युगे॥४-८॥",
      "summary": "To protect the righteous, destroy the wicked, and establish dharma, I come in every age.",
      "details": "Krishna continues explaining the purpose of divine incarnation. The Lord appears age after age to protect devotees and good people, to annihilate evil-doers, and to firmly establish the principles of dharma. This verse assures that divine justice prevails and righteousness is ultimately protected.",
      "tags": [
        "divine purpose",
        "protection",
        "justice",
        "dharma",
        "cosmic cycle"
      ],
      "sr#": "4-8",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 6,
      "shloka": "उद्धरेदात्मनात्मानं नात्मानमवसादयेत्। आत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मनः॥६-५॥",
      "summary": "One must elevate oneself by one's own mind; the mind is both friend and enemy of the self.",
      "details": "Krishna teaches the importance of self-mastery and self-effort. A person should uplift themselves through their own efforts and not degrade themselves. The mind can be one's best friend if controlled, or one's worst enemy if allowed to run wild. Self-discipline and self-control are essential for spiritual progress.",
      "tags": [
        "self-control",
        "mind",
        "self-effort",
        "discipline",
        "spiritual progress"
      ],
      "sr#": "6-5",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 6,
      "shloka": "यतो यतो निश्चरति मनश्चञ्चलमस्थिरम्। ततस्ततो नियम्यैतदात्मन्येव वशं नयेत्॥६-२६॥",
      "summary": "Whenever the restless mind wanders, one should restrain it and bring it back under control.",
      "details": "This verse provides practical guidance for meditation. The mind is naturally restless and unstable, wandering from one object to another. Whenever it strays, the practitioner should gently bring it back and fix it on the Self or the chosen object of meditation. This practice of repeatedly bringing back the wandering mind is the essence of meditation.",
      "tags": [
        "meditation",
        "mind control",
        "concentration",
        "practice",
        "restlessness"
      ],
      "sr#": "6-26",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 2,
      "shloka": "दुःखेष्वनुद्विग्नमनाः सुखेषु विगतस्पृहः। वीतरागभयक्रोधः स्थितधीर्मुनिरुच्यते॥२-५६॥",
      "summary": "One whose mind is unperturbed by sorrow, free from desire for pleasure, and devoid of attachment, fear, and anger is called a sage of steady wisdom.",
      "details": "Krishna describes the characteristics of a self-realized person (Sthitaprajna). Such a person remains calm in adversity, has no craving for pleasures, and is free from attachment, fear, and anger. This state of consciousness represents perfect spiritual balance and is the goal of Yoga practice.",
      "tags": [
        "steady wisdom",
        "self-realization",
        "equanimity",
        "detachment",
        "sage"
      ],
      "sr#": "2-56",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 2,
      "shloka": "ध्यायतो विषयान्पुंसः सङ्गस्तेषूपजायते। सङ्गात्संजायते कामः कामात्क्रोधोऽभिजायते॥२-६२॥",
      "summary": "Contemplating sense objects leads to attachment, attachment breeds desire, and from desire arises anger.",
      "details": "Krishna explains the psychology of bondage. When a person repeatedly thinks about sense objects, attachment develops. From attachment comes desire for possession. When desire is obstructed, anger arises. This chain reaction shows how mental dwelling on objects leads to emotional disturbance and spiritual downfall.",
      "tags": [
        "desire",
        "attachment",
        "anger",
        "sense objects",
        "psychology"
      ],
      "sr#": "2-62",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 2,
      "shloka": "क्रोधाद्भवति सम्मोहः सम्मोहात्स्मृतिविभ्रमः। स्मृतिभ्रंशाद्बुद्धिनाशो बुद्धिनाशात्प्रणश्यति॥२-६३॥",
      "summary": "From anger comes delusion, from delusion loss of memory, from loss of memory destruction of intelligence, and from that one perishes.",
      "details": "This verse continues the chain of spiritual degradation. Anger leads to delusion (loss of discrimination), which causes memory loss (forgetting one's true nature and teachings). This results in destruction of intelligence, leading ultimately to complete spiritual ruin. This progression shows the danger of uncontrolled anger.",
      "tags": [
        "anger",
        "delusion",
        "downfall",
        "spiritual degradation",
        "psychology"
      ],
      "sr#": "2-63",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 3,
      "shloka": "श्रेयान्स्वधर्मो विगुणः परधर्मात्स्वनुष्ठितात्। स्वधर्मे निधनं श्रेयः परधर्मो भयावहः॥३-३५॥",
      "summary": "Better is one's own dharma, though imperfect, than another's dharma well performed. Death in one's own dharma is better; another's dharma brings danger.",
      "details": "Krishna emphasizes the importance of following one's own duty (swadharma) according to one's nature and position, even if imperfectly performed, rather than adopting another's duty. Trying to perform duties unsuited to one's nature, even if done well, creates inner conflict and is spiritually dangerous. This teaches authenticity and self-acceptance.",
      "tags": [
        "swadharma",
        "duty",
        "authenticity",
        "natural law",
        "self-acceptance"
      ],
      "sr#": "3-35",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 3,
      "shloka": "यद्यदाचरति श्रेष्ठस्तत्तदेवेतरो जनः। स यत्प्रमाणं कुरुते लोकस्तदनुवर्तते॥३-२१॥",
      "summary": "Whatever a great person does, others follow. Whatever standards they set, the world follows.",
      "details": "Krishna explains the principle of leadership by example. Great people and leaders set the standard for society. Their actions become the model that others emulate. Therefore, those in positions of influence have a special responsibility to act righteously, as their behavior shapes society's values and conduct.",
      "tags": [
        "leadership",
        "example",
        "influence",
        "responsibility",
        "society"
      ],
      "sr#": "3-21",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 3,
      "shloka": "काम एष क्रोध एष रजोगुणसमुद्भवः। महाशनो महापाप्मा विद्ध्येनमिह वैरिणम्॥३-३७॥",
      "summary": "It is desire and anger, born of passion, all-consuming and sinful - know this as the enemy.",
      "details": "When Arjuna asks what forces a person to commit sin, Krishna identifies desire (kama) and anger (krodha) as the culprits. These arise from rajas (the mode of passion), are insatiable and highly sinful. They are the real enemies that must be conquered. Understanding this helps in spiritual practice by identifying the obstacles.",
      "tags": [
        "desire",
        "anger",
        "passion",
        "enemy",
        "obstacles"
      ],
      "sr#": "3-37",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 4,
      "shloka": "चातुर्वर्ण्यं मया सृष्टं गुणकर्मविभागशः। तस्य कर्तारमपि मां विद्ध्यकर्तारमव्ययम्॥४-१३॥",
      "summary": "The four divisions of society were created by Me according to quality and action, though I am their creator, know Me as the non-doer and eternal.",
      "details": "Krishna explains that the social order (varna) is based on qualities (guna) and actions (karma), not birth. Though He created this system, He remains detached from it as the eternal non-doer. This verse teaches that one's position should be determined by inherent qualities and abilities, not hereditary status.",
      "tags": [
        "varna",
        "social order",
        "qualities",
        "karma",
        "divine order"
      ],
      "sr#": "4-13",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 4,
      "shloka": "ज्ञानाग्निः सर्वकर्माणि भस्मसात्कुरुते तथा। यथैधांसि समिद्धोऽग्निर्भस्मसात्कुरुतेऽर्जुन॥४-३७॥",
      "summary": "As a blazing fire reduces wood to ashes, the fire of knowledge reduces all karma to ashes.",
      "details": "Krishna uses the metaphor of fire to explain the power of spiritual knowledge. Just as fire completely burns wood to ashes, the fire of self-knowledge (jnana) burns away all karmas and their reactions. This knowledge of the Self liberates one from the bondage of action and its consequences.",
      "tags": [
        "knowledge",
        "liberation",
        "karma",
        "wisdom",
        "fire metaphor"
      ],
      "sr#": "4-37",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 5,
      "shloka": "योगसंन्यस्तकर्माणं ज्ञानसञ्छिन्नसंशयम्। आत्मवन्तं न कर्माणि निबध्नन्ति धनञ्जय॥५-३॥",
      "summary": "Actions do not bind one who has renounced actions through yoga, whose doubts are destroyed by knowledge, and who is self-controlled.",
      "details": "Krishna explains that actions bind only the ignorant. One who has renounced the fruits of actions through yoga practice, whose doubts have been cut by knowledge, and who is established in Self-awareness is not bound by any action. Such a person acts in freedom.",
      "tags": [
        "renunciation",
        "yoga",
        "knowledge",
        "liberation",
        "freedom"
      ],
      "sr#": "5-3",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 5,
      "shloka": "ब्रह्मण्याधाय कर्माणि सङ्गं त्यक्त्वा करोति यः। लिप्यते न स पापेन पद्मपत्रमिवाम्भसा॥५-१०॥",
      "summary": "One who acts offering all actions to Brahman and abandoning attachment is not tainted by sin, like a lotus leaf untouched by water.",
      "details": "Krishna uses the beautiful lotus analogy. Just as a lotus leaf remains unaffected by water, one who performs actions as an offering to the Divine, without attachment or sense of doership, remains untainted by sin. This verse teaches the art of living in the world without being affected by it.",
      "tags": [
        "detachment",
        "offering",
        "purity",
        "lotus",
        "spiritual practice"
      ],
      "sr#": "5-10",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 6,
      "shloka": "योगिनो यं संस्कृता यां सर्वदा। आत्मसंस्थं मनः कृत्वा यच्छेद्वैराग्यमाश्रितः॥६-१०॥",
      "summary": "The yogi should constantly practice concentration, remaining in solitude, controlling mind and body, free from desires and possessiveness.",
      "details": "Krishna provides practical instructions for meditation practice. The practitioner should regularly practice alone in a quiet place, controlling the mind and body, maintaining detachment from desires and possessions. This disciplined practice is essential for spiritual progress and Self-realization.",
      "tags": [
        "meditation practice",
        "solitude",
        "discipline",
        "concentration",
        "detachment"
      ],
      "sr#": "6-10",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 6,
      "shloka": "युक्ताहारविहारस्य युक्तचेष्टस्य कर्मसु। युक्तस्वप्नावबोधस्य योगो भवति दुःखहा॥६-१७॥",
      "summary": "Yoga destroys all sorrow for one who is moderate in eating and recreation, balanced in work, and regulated in sleep and wakefulness.",
      "details": "Krishna emphasizes the importance of moderation in daily life. One who is balanced in diet and activities, disciplined in work and duties, and regular in sleep patterns finds that yoga practice effectively removes all suffering. This verse teaches that spiritual practice must be supported by a balanced lifestyle.",
      "tags": [
        "moderation",
        "balance",
        "lifestyle",
        "discipline",
        "yoga practice"
      ],
      "sr#": "6-17",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 6,
      "shloka": "योऽन्तःसुखोऽन्तरारामस्तथान्तर्ज्योतिरेव यः। स योगी ब्रह्मनिर्वाणं ब्रह्मभूतोऽधिगच्छति॥६-२७॥",
      "summary": "The yogi who finds happiness within, rejoices within, and is illuminated within attains Brahman and supreme peace.",
      "details": "Krishna describes the self-realized yogi who has turned inward. Such a person finds joy, satisfaction, and light within themselves rather than in external objects. Having realized their identity with Brahman, they attain supreme peace (Brahma-nirvana) and liberation.",
      "tags": [
        "inner joy",
        "self-realization",
        "Brahman",
        "liberation",
        "peace"
      ],
      "sr#": "6-27",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 7,
      "shloka": "मनुष्याणां सहस्रेषु कश्चिद्यतति सिद्धये। यततामपि सिद्धानां कश्चिन्मां वेत्ति तत्त्वतः॥७-३॥",
      "summary": "Among thousands of people, one may strive for perfection; among those who strive, one may know Me in truth.",
      "details": "Krishna reveals the rarity of God-realization. Out of thousands, perhaps one seeks spiritual perfection. Among those who seek, only a rare soul truly knows the Divine in essence. This verse doesn't discourage but emphasizes the value of genuine spiritual seeking and the rare achievement of complete realization.",
      "tags": [
        "rarity",
        "spiritual seeking",
        "God-realization",
        "perfection",
        "truth"
      ],
      "sr#": "7-3",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 7,
      "shloka": "दैवी ह्येषा गुणमयी मम माया दुरत्यया। मामेव ये प्रपद्यन्ते मायामेतां तरन्ति ते॥७-१४॥",
      "summary": "This divine Maya of Mine made of the three gunas is difficult to overcome; those who surrender to Me alone cross beyond it.",
      "details": "Krishna explains that the divine Maya (illusion) composed of the three gunas (qualities) is extremely difficult to transcend. However, those who surrender exclusively to the Lord can cross beyond this Maya. This verse reveals both the power of illusion and the sure path to liberation through surrender.",
      "tags": [
        "maya",
        "illusion",
        "gunas",
        "surrender",
        "transcendence"
      ],
      "sr#": "7-14",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 7,
      "shloka": "चतुर्विधा भजन्ते मां जनाः सुकृतिनोऽर्जुन। आर्तो जिज्ञासुरर्थार्थी ज्ञानी च भरतर्षभ॥७-१६॥",
      "summary": "Four types of virtuous people worship Me: the distressed, the seeker of knowledge, the seeker of wealth, and the wise.",
      "details": "Krishna categorizes devotees into four types: those in distress seeking relief, those seeking spiritual knowledge, those desiring material prosperity, and the wise who know the truth. All are good people, but the wise devotee who loves God for His own sake is most dear to the Lord.",
      "tags": [
        "devotion",
        "types of devotees",
        "wisdom",
        "worship",
        "spiritual seeking"
      ],
      "sr#": "7-16",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 8,
      "shloka": "अन्तकाले च मामेव स्मरन्मुक्त्वा कलेवरम्। यः प्रयाति स मद्भावं याति नास्त्यत्र संशयः॥८-५॥",
      "summary": "One who remembers Me alone at the time of death, leaving the body, attains My nature - of this there is no doubt.",
      "details": "Krishna assures that whoever thinks of Him at the moment of death will certainly attain Him. The last thought at death determines the next destination. This emphasizes the importance of constant practice during life so that remembrance of God becomes natural even at death.",
      "tags": [
        "death",
        "remembrance",
        "liberation",
        "final thought",
        "assurance"
      ],
      "sr#": "8-5",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 8,
      "shloka": "यं यं वापि स्मरन्भावं त्यजत्यन्ते कलेवरम्। तं तमेवैति कौन्तेय सदा तद्भावभावितः॥८-६॥",
      "summary": "Whatever state of being one remembers when leaving the body, that state they attain, being always absorbed in that thought.",
      "details": "Krishna explains the law of the final thought. Whatever one consistently thinks about throughout life and consequently remembers at death determines one's next state of existence. This teaches the importance of constant spiritual practice and pure thoughts, as they shape our destiny.",
      "tags": [
        "law of thought",
        "destiny",
        "practice",
        "consciousness",
        "death"
      ],
      "sr#": "8-6",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 9,
      "shloka": "मयि सर्वमिदं प्रोतं सूत्रे मणिगणा इव। अहं सर्वस्य प्रभवो मत्तः सर्वं प्रवर्तते॥९-४॥",
      "summary": "All this universe is pervaded by Me in My unmanifest form; all beings exist in Me, but I do not exist in them.",
      "details": "Krishna reveals His relationship with the universe. Everything is strung on Him like pearls on a thread, yet He transcends everything. All beings exist in Him through His divine energy, but He remains beyond them, unaffected and independent. This describes the transcendent-immanent nature of God.",
      "tags": [
        "omnipresence",
        "transcendence",
        "immanence",
        "divine nature",
        "cosmos"
      ],
      "sr#": "9-4",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 9,
      "shloka": "पत्रं पुष्पं फलं तोयं यो मे भक्त्या प्रयच्छति। तदहं भक्त्युपहृतमश्नामि प्रयतात्मनः॥९-२६॥",
      "summary": "Whoever offers Me with devotion a leaf, flower, fruit, or water, I accept that offering of love from the pure-hearted.",
      "details": "Krishna emphasizes that what matters in worship is not the material value but the devotion behind it. Even simple offerings like a leaf, flower, fruit, or water are accepted with joy when offered with pure love and devotion. This democratizes worship - spiritual connection is available to all regardless of material means.",
      "tags": [
        "devotion",
        "offering",
        "love",
        "simplicity",
        "pure heart"
      ],
      "sr#": "9-26",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 9,
      "shloka": "यत्करोषि यदश्नासि यज्जुहोषि ददासि यत्। यत्तपस्यसि कौन्तेय तत्कुरुष्व मदर्पणम्॥९-२७॥",
      "summary": "Whatever you do, eat, offer, give, or practice as austerity, do it as an offering to Me.",
      "details": "Krishna teaches the practice of karma yoga in daily life. Every action - work, eating, worship, charity, discipline - should be done as an offering to the Divine. This transforms all activities into spiritual practice, sanctifies daily life, and leads to liberation while engaged in worldly duties.",
      "tags": [
        "karma yoga",
        "offering",
        "daily practice",
        "sanctification",
        "dedication"
      ],
      "sr#": "9-27",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 9,
      "shloka": "मन्मना भव मद्भक्तो मद्याजी मां नमस्कुरु। मामेवैष्यसि युक्त्वैवमात्मानं मत्परायणः॥९-३४॥",
      "summary": "Fix your mind on Me, be devoted to Me, worship Me, and bow to Me - thus you will come to Me.",
      "details": "Krishna reveals the path of devotion (Bhakti Yoga). By constantly thinking of the Divine, developing devotion, offering worship, and surrendering completely, one attains union with God. This verse emphasizes the power of single-pointed devotion and complete surrender as a means to realize the Supreme.",
      "tags": [
        "bhakti",
        "devotion",
        "worship",
        "surrender",
        "God-realization"
      ],
      "sr#": "9-34",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 10,
      "shloka": "अहमात्मा गुडाकेश सर्वभूताशयस्थितः। अहमादिश्च मध्यं च भूतानामन्त एव च॥१०-२०॥",
      "summary": "I am the Self seated in the hearts of all beings; I am the beginning, middle, and end of all beings.",
      "details": "Krishna reveals His all-pervading nature. He is the innermost Self (Atman) residing in all hearts. He is the source, sustainer, and final end of all existence. This verse establishes the fundamental unity of all life and the omnipresence of the Divine.",
      "tags": [
        "Self",
        "omnipresence",
        "divine nature",
        "unity",
        "Atman"
      ],
      "sr#": "10-20",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 10,
      "shloka": "यद्यद्विभूतिमत्सत्त्वं श्रीमदूर्जितमेव वा। तत्तदेवावगच्छ त्वं मम तेजोंऽशसम्भवम्॥१०-४१॥",
      "summary": "Whatever is glorious, prosperous, or powerful, know that to be a manifestation of a fraction of My splendor.",
      "details": "Krishna explains that all greatness, beauty, power, and excellence in the world are mere fragments of His infinite glory. Whatever manifests extraordinary qualities - in nature, art, knowledge, or character - is a spark of the Divine. This helps in seeing God in all expressions of excellence.",
      "tags": [
        "divine glory",
        "manifestation",
        "excellence",
        "splendor",
        "recognition"
      ],
      "sr#": "10-41",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 11,
      "shloka": "अनेकवक्त्रनयनमनेकाद्भुतदर्शनम्। अनेकदिव्याभरणं दिव्यानेकोद्यतायुधम्॥११-१०॥",
      "summary": "With countless mouths and eyes, countless wondrous visions, countless divine ornaments, and countless upraised divine weapons.",
      "details": "Arjuna describes the Cosmic Form (Vishvarupa) of Krishna that he witnesses through divine vision. It is unlimited, with infinite faces, eyes, ornaments, and weapons. This vision reveals the infinite, all-encompassing nature of the Divine that transcends normal human comprehension.",
      "tags": [
        "cosmic form",
        "divine vision",
        "infinity",
        "Vishvarupa",
        "revelation"
      ],
      "sr#": "11-10",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 11,
      "shloka": "कालोऽस्मि लोकक्षयकृत्प्रवृद्धो लोकान्समाहर्तुमिह प्रवृत्तः। ऋतेऽपि त्वां न भविष्यन्ति सर्वे येऽवस्थिताः प्रत्यनीकेषु योधाः॥११-३२॥",
      "summary": "I am Time, the destroyer of worlds, engaged in annihilating people. Even without you, all these warriors shall cease to exist.",
      "details": "In His cosmic form, Krishna reveals Himself as Time (Kala), the ultimate destroyer. He assures Arjuna that all the warriors are already destined to die by His will. This profound revelation places the war in cosmic perspective, showing that Arjuna is merely an instrument of the divine plan.",
      "tags": [
        "Time",
        "destiny",
        "cosmic will",
        "destruction",
        "instrument"
      ],
      "sr#": "11-32",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 12,
      "shloka": "मय्येव मन आधत्स्व मयि बुद्धिं निवेशय। निवसिष्यसि मय्येव अत ऊर्ध्वं न संशयः॥१२-८॥",
      "summary": "Fix your mind on Me alone, let your intellect dwell in Me; thereafter you shall live in Me without doubt.",
      "details": "Krishna teaches the direct path of constant remembrance. By fixing the mind and intellect completely on the Divine, one attains immediate union with God. This single-pointed devotion is the most direct method of realization, requiring total mental absorption in the Divine.",
      "tags": [
        "concentration",
        "devotion",
        "union",
        "mind",
        "certainty"
      ],
      "sr#": "12-8",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 12,
      "shloka": "अद्वेष्टा सर्वभूतानां मैत्रः करुण एव च। निर्ममो निरहङ्कारः समदुःखसुखः क्षमी॥१२-१३॥",
      "summary": "One who harbors no hatred toward any being, is friendly and compassionate, free from possessiveness and ego, balanced in pleasure and pain, and forgiving.",
      "details": "Krishna describes the qualities of a true devotee. Such a person has no ill-will toward anyone, is friendly and compassionate to all, has no sense of ownership or ego, remains balanced in all situations, and is forgiving. These qualities naturally develop in one who sees the Divine in all beings.",
      "tags": [
        "compassion",
        "forgiveness",
        "friendliness",
        "equanimity",
        "devotee qualities"
      ],
      "sr#": "12-13",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 12,
      "shloka": "सममित्रारिपक्षेषु तुल्यनिन्दात्मसंस्तुतिः। मानापमानयोस्तुल्यस्तुष्टो येन केनचित्॥१२-१८॥",
      "summary": "One who is equal towards friend and foe, balanced in honor and dishonor, and content in all circumstances.",
      "details": "Krishna describes the qualities of a true devotee. Such a person treats friends, enemies, and neutral parties alike; remains unaffected by praise or criticism; stays balanced whether honored or dishonored; and remains content in all circumstances. This equanimity comes from seeing the Divine in all and transcending dualities.",
      "tags": [
        "equanimity",
        "devotion",
        "balance",
        "contentment",
        "transcendence"
      ],
      "sr#": "12-18",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 13,
      "shloka": "क्षेत्रक्षेत्रज्ञयोर्ज्ञानं यत्तज्ज्ञानं मतं मम॥१३-३॥",
      "summary": "Knowledge of both the field and the knower of the field is, in My opinion, true knowledge.",
      "details": "Krishna introduces the teaching about Kshetra (the field - body and mind) and Kshetrajna (the knower - the Self). True knowledge involves understanding both the material nature (body-mind complex) and the conscious witness (the eternal Self). This discrimination is essential for spiritual realization.",
      "tags": [
        "knowledge",
        "Self",
        "body-mind",
        "discrimination",
        "spiritual wisdom"
      ],
      "sr#": "13-3",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 13,
      "shloka": "अमानित्वमदम्भित्वमहिंसा क्षान्तिरार्जवम्। आचार्योपासनं शौचं स्थैर्यमात्मविनिग्रहः॥१३-८॥",
      "summary": "Humility, modesty, non-violence, forgiveness, uprightness, service to teacher, purity, steadfastness, and self-control.",
      "details": "Krishna begins listing the qualities that constitute knowledge. These include humility, absence of hypocrisy, non-violence, patience, straightforwardness, reverence for teachers, cleanliness, stability, and control over the senses. These virtues prepare the mind for receiving spiritual knowledge.",
      "tags": [
        "virtues",
        "humility",
        "non-violence",
        "self-control",
        "spiritual qualities"
      ],
      "sr#": "13-8",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 13,
      "shloka": "समं सर्वेषु भूतेषु तिष्ठन्तं परमेश्वरम्। विनश्यत्स्वविनश्यन्तं यः पश्यति स पश्यति॥१३-२८॥",
      "summary": "One who sees the Supreme Lord dwelling equally in all beings, the imperishable within the perishable, truly sees.",
      "details": "Real vision consists in perceiving the eternal Divine presence in all creatures equally. While bodies decay, the indwelling Lord is imperishable. One who recognizes this unchanging consciousness in all changing forms possesses true spiritual sight. This vision leads to liberation.",
      "tags": [
        "equal vision",
        "divine presence",
        "true seeing",
        "imperishable",
        "spiritual sight"
      ],
      "sr#": "13-28",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 14,
      "shloka": "सत्त्वं रजस्तम इति गुणाः प्रकृतिसम्भवाः। निबध्नन्ति महाबाहो देहे देहिनमव्ययम्॥१४-५॥",
      "summary": "Sattva, rajas, and tamas - these qualities born of prakriti bind the imperishable soul to the body.",
      "details": "Krishna explains how the three gunas (qualities of nature) - goodness, passion, and ignorance - originating from material nature, bind the eternal soul to the physical body. Understanding these modes is crucial for spiritual progress as they influence all thoughts, feelings, and actions.",
      "tags": [
        "gunas",
        "prakriti",
        "bondage",
        "qualities",
        "material nature"
      ],
      "sr#": "14-5",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 14,
      "shloka": "यदा सत्त्वे प्रवृद्धे तु प्रलयं याति देहभृत्। तदोत्तमविदां लोकानमलान्प्रतिपद्यते॥१४-१४॥",
      "summary": "When one dies during the predominance of sattva, they attain the pure worlds of the knowers of the highest.",
      "details": "Krishna explains the consequence of dying in different modes. Death while established in sattva (goodness) leads to higher, pure realms of the wise. This emphasizes the importance of cultivating sattvic qualities - purity, knowledge, and harmony - for spiritual evolution.",
      "tags": [
        "sattva",
        "death",
        "higher realms",
        "purity",
        "spiritual evolution"
      ],
      "sr#": "14-14",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 14,
      "shloka": "गुणानेतानतीत्य त्रीन्देही देहसमुद्भवान्। जन्ममृत्युजरादुःखैर्विमुक्तोऽमृतमश्नुते॥१४-२०॥",
      "summary": "Transcending these three gunas born of the body, one is freed from birth, death, old age, and sorrow, attaining immortality.",
      "details": "When a person rises above the influence of all three gunas, they become free from the cycle of birth and death with its attendant suffering. This transcendence of the gunas leads to realization of the immortal Self and liberation from all bondage.",
      "tags": [
        "transcendence",
        "liberation",
        "immortality",
        "freedom",
        "gunas"
      ],
      "sr#": "14-20",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 14,
      "shloka": "मां च योऽव्यभिचारेण भक्तियोगेन सेवते। स गुणान्समतीत्यैतान्ब्रह्मभूयाय कल्पते॥१४-२६॥",
      "summary": "One who serves Me with unwavering devotion transcends the gunas and becomes fit for realizing Brahman.",
      "details": "Krishna reveals that steadfast devotion (bhakti yoga) is the means to transcend the gunas. Through exclusive devotion to the Lord, one rises above the influence of the three modes of nature and becomes qualified for union with Brahman, the Supreme Reality.",
      "tags": [
        "devotion",
        "transcendence",
        "Brahman",
        "bhakti yoga",
        "realization"
      ],
      "sr#": "14-26",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 15,
      "shloka": "ऊर्ध्वमूलमधःशाखमश्वत्थं प्राहुरव्ययम्। छन्दांसि यस्य पर्णानि यस्तं वेद स वेदवित्॥१५-१॥",
      "summary": "The eternal ashvattha tree has roots above and branches below; its leaves are the Vedas, and one who knows this knows the Vedas.",
      "details": "Krishna uses the metaphor of an inverted tree (ashvattha/banyan) to describe the material world. Its roots are in Brahman above, and branches extend downward into the material realm. The Vedas are its leaves. Understanding this cosmic tree means understanding the nature of existence and its source.",
      "tags": [
        "cosmic tree",
        "metaphor",
        "Vedas",
        "material world",
        "spiritual knowledge"
      ],
      "sr#": "15-1",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 15,
      "shloka": "उत्तमः पुरुषस्त्वन्यः परमात्मेत्युदाहृतः। यो लोकत्रयमाविश्य बिभर्त्यव्यय ईश्वरः॥१५-१७॥",
      "summary": "But distinct is the Supreme Purusha called the Paramatma, the imperishable Lord who pervades and sustains the three worlds.",
      "details": "Krishna distinguishes the Supreme Person (Purushottama) from both the perishable body and imperishable soul. This highest reality, called Paramatma (Supreme Self), pervades and maintains all three worlds. This verse establishes the transcendent aspect of divinity beyond creation.",
      "tags": [
        "Supreme Self",
        "Paramatma",
        "transcendence",
        "sustainer",
        "ultimate reality"
      ],
      "sr#": "15-17",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 15,
      "shloka": "यो मामेवमसम्मूढो जानाति पुरुषोत्तमम्। स सर्वविद्भजति मां सर्वभावेन भारत॥१५-१९॥",
      "summary": "One who, undeluded, knows Me as the Supreme Person knows everything and worships Me with their whole being.",
      "details": "Krishna states that one who truly understands Him as Purushottama (the Supreme Person) without confusion possesses complete knowledge. Such a person naturally worships the Lord with full devotion and dedication, having realized the ultimate truth.",
      "tags": [
        "knowledge",
        "Supreme Person",
        "worship",
        "complete understanding",
        "devotion"
      ],
      "sr#": "15-19",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 16,
      "shloka": "अभयं सत्त्वसंशुद्धिर्ज्ञानयोगव्यवस्थितिः। दानं दमश्च यज्ञश्च स्वाध्यायस्तप आर्जवम्॥१६-१॥",
      "summary": "Fearlessness, purity of heart, steadfastness in knowledge and yoga, charity, self-control, sacrifice, study of scriptures, austerity, and uprightness.",
      "details": "Krishna begins describing divine qualities (daivi sampad) that lead to liberation. These include fearlessness, inner purity, dedication to wisdom, generosity, restraint, worship, scriptural study, discipline, and honesty. Cultivating these virtues leads to spiritual evolution.",
      "tags": [
        "divine qualities",
        "virtues",
        "fearlessness",
        "purity",
        "spiritual development"
      ],
      "sr#": "16-1",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 16,
      "shloka": "दम्भो दर्पोऽभिमानश्च क्रोधः पारुष्यमेव च। अज्ञानं चाभिजातस्य पार्थ सम्पदमासुरीम्॥१६-४॥",
      "summary": "Hypocrisy, arrogance, pride, anger, harshness, and ignorance belong to one born with demoniac qualities.",
      "details": "In contrast to divine qualities, Krishna lists demoniac traits (asuri sampad): hypocrisy, conceit, excessive pride, anger, cruelty, and ignorance. These qualities bind one to material existence and lead to downfall. Awareness of these helps in avoiding destructive patterns.",
      "tags": [
        "demoniac qualities",
        "negative traits",
        "ignorance",
        "pride",
        "spiritual obstacles"
      ],
      "sr#": "16-4",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 16,
      "shloka": "त्रिविधं नरकस्येदं द्वारं नाशनमात्मनः। कामः क्रोधस्तथा लोभस्तस्मादेतत्त्रयं त्यजेत्॥१६-२१॥",
      "summary": "Triple is the gate of hell, destructive of the self: desire, anger, and greed. Therefore, abandon these three.",
      "details": "Krishna identifies three primary vices that lead to spiritual destruction: lust/desire (kama), anger (krodha), and greed (lobha). These are the gateways to hell and self-ruin. Renouncing these three is essential for spiritual progress and peace.",
      "tags": [
        "desire",
        "anger",
        "greed",
        "spiritual destruction",
        "renunciation"
      ],
      "sr#": "16-21",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 17,
      "shloka": "श्रद्धामयोऽयं पुरुषो यो यच्छ्रद्धः स एव सः। सत्त्वानुरूपा सर्वस्य श्रद्धा भवति भारत॥१७-३॥",
      "summary": "A person consists of their faith; whatever their faith is, so are they. Everyone's faith conforms to their nature.",
      "details": "Krishna reveals that faith (shraddha) defines a person's being. One's faith corresponds to their inner nature and determines their character and actions. This emphasizes that transformation begins with cultivating right faith and understanding.",
      "tags": [
        "faith",
        "character",
        "nature",
        "identity",
        "transformation"
      ],
      "sr#": "17-3",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 17,
      "shloka": "आहारस्त्वपि सर्वस्य त्रिविधो भवति प्रियः। यज्ञस्तपस्तथा दानं तेषां भेदमिमं शृणु॥१७-७॥",
      "summary": "The food dear to each is of three kinds, as are sacrifice, austerity, and charity. Hear their distinctions.",
      "details": "Krishna explains that everything - food, worship, discipline, and charity - is influenced by the three gunas. Understanding these distinctions helps in making conscious choices that elevate one's consciousness rather than binding it to lower modes.",
      "tags": [
        "gunas",
        "food",
        "classification",
        "worship",
        "conscious choice"
      ],
      "sr#": "17-7",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 17,
      "shloka": "ॐ तत्सदिति निर्देशो ब्रह्मणस्त्रिविधः स्मृतः। ब्राह्मणास्तेन वेदाश्च यज्ञाश्च विहिताः पुरा॥१७-२३॥",
      "summary": "Om Tat Sat - this threefold designation of Brahman was established by the wise in ancient times along with the Vedas and sacrifices.",
      "details": "Krishna explains the sacred formula 'Om Tat Sat' representing Brahman in three aspects. Om is the eternal sound, Tat means 'That' (the absolute), and Sat means 'Truth' or 'Existence'. This formula sanctifies all spiritual practices when used with proper understanding.",
      "tags": [
        "Om Tat Sat",
        "Brahman",
        "sacred formula",
        "mantra",
        "spiritual practice"
      ],
      "sr#": "17-23",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 18,
      "shloka": "त्याग एवा विवेकेन त्यागः सात्त्विको मतः। न कर्मफलत्यागस्तु राजसः परिकीर्तितः॥१८-९॥",
      "summary": "Renunciation of the fruit of action with discrimination is considered sattvic renunciation, not abandoning action itself.",
      "details": "Krishna clarifies true renunciation. Sattvic (pure) renunciation means performing one's duty while renouncing attachment to results, not abandoning responsibilities. Rajasic (passionate) renunciation involves avoiding duties out of difficulty. True renunciation is performing duties selflessly.",
      "tags": [
        "renunciation",
        "discrimination",
        "duty",
        "sattva",
        "detachment"
      ],
      "sr#": "18-9",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 18,
      "shloka": "यस्त्वात्मरतिरेव स्यादात्मतृप्तश्च मानवः। आत्मन्येव च संतुष्टस्तस्य कार्यं न विद्यते॥१८-१७॥",
      "summary": "One who rejoices in the Self alone, is satisfied in the Self, and is content in the Self has nothing left to accomplish.",
      "details": "Krishna describes the liberated soul who finds complete fulfillment within. Such a person derives joy, satisfaction, and contentment from the Self alone, not from external objects. Having realized the Self, they have no obligatory duties left, though they may act for the welfare of the world.",
      "tags": [
        "Self-realization",
        "contentment",
        "inner joy",
        "liberation",
        "fulfillment"
      ],
      "sr#": "18-17",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 18,
      "shloka": "सर्वभूतेषु येनैकं भावमव्ययमीक्षते। अविभक्तं विभक्तेषु तज्ज्ञानं विद्धि सात्त्विकम्॥१८-२०॥",
      "summary": "Knowledge by which one sees the imperishable, undivided reality in all divided beings is sattvic knowledge.",
      "details": "Krishna defines knowledge of the highest order. Sattvic knowledge perceives the one eternal, undivided consciousness pervading all apparently separate beings. This unifying vision that sees the One in the many represents true spiritual wisdom.",
      "tags": [
        "sattvic knowledge",
        "unity",
        "spiritual wisdom",
        "one in many",
        "true vision"
      ],
      "sr#": "18-20",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 18,
      "shloka": "यत्तदग्रे विषमिव परिणामेऽमृतोपमम्। तत्सुखं सात्त्विकं प्रोक्तमात्मबुद्धिप्रसादजम्॥१८-३७॥",
      "summary": "Happiness that is like poison at first but like nectar at the end, born of the clarity of self-understanding, is called sattvic.",
      "details": "Sattvic happiness arises from self-knowledge and meditation. Though it may seem difficult initially like poison (requiring effort and discipline), it ultimately yields nectar-like bliss. This lasting joy comes from inner clarity and spiritual understanding, unlike fleeting sensory pleasures.",
      "tags": [
        "sattvic happiness",
        "self-knowledge",
        "lasting joy",
        "discipline",
        "spiritual bliss"
      ],
      "sr#": "18-37",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 18,
      "shloka": "तस्मात्सर्वेषु कालेषु मामनुस्मर युध्य च। मय्यर्पितमनोबुद्धिर्मामेवैष्यस्यसंशयम्॥१८-५७॥",
      "summary": "Therefore, remember Me at all times and fight. With mind and intellect surrendered to Me, you will certainly come to Me.",
      "details": "Krishna gives Arjuna the practical synthesis: maintain constant remembrance of God while performing your duty. By dedicating mind and intellect to the Divine while acting, one ensures union with God. This combines devotion with action, the essence of the Gita's teaching.",
      "tags": [
        "remembrance",
        "action",
        "synthesis",
        "surrender",
        "duty"
      ],
      "sr#": "18-57",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 18,
      "shloka": "मन्मना भव मद्भक्तो मद्याजी मां नमस्कुरु। मामेवैष्यसि सत्यं ते प्रतिजाने प्रियोऽसि मे॥१८-६५॥",
      "summary": "Fix your mind on Me, be My devotee, worship Me, bow to Me. You will come to Me, I promise you truly, for you are dear to Me.",
      "details": "Krishna repeats the essential teaching with special emphasis, adding His personal promise. By fixing the mind on Him, developing devotion, offering worship, and surrendering, one will definitely attain Him. The Lord's promise reflects His love and assurance to the sincere seeker.",
      "tags": [
        "devotion",
        "promise",
        "divine love",
        "surrender",
        "assurance"
      ],
      "sr#": "18-65",
      "notes": "",
      "audio": ""
    },
    {
      "chapter": 18,
      "shloka": "सर्वधर्मान्परित्यज्य मामेकं शरणं व्रज। अहं त्वा सर्वपापेभ्यो मोक्षयिष्यामि मा शुचः॥१८-६६॥",
      "summary": "Abandon all dharmas and surrender unto Me alone; I shall liberate you from all sins, do not grieve.",
      "details": "This is the final and most important teaching of the Bhagavad Gita. Krishna asks Arjuna to give up all other duties and completely surrender to Him. The Lord promises that He will deliver the devotee from all sins and karmic reactions. This verse emphasizes complete surrender (Prapatti) as the ultimate path to liberation, assuring divine grace and protection.",
      "tags": [
        "surrender",
        "liberation",
        "grace",
        "ultimate teaching",
        "moksha",
        "divine promise"
      ],
      "sr#": "18-66",
      "notes": "",
      "audio": ""
    }
  ]
}